
&НаСервереБезКонтекста
Процедура СформироватьПакетНаСервере()
	ТипПакета = ФабрикаXDTO.Тип("СтруктураДляПолученияСреднего","СтруктураДанных");
	СтруктураДанных = ФабрикаXDTO.Создать(ТипПакета);
	СтруктураДанных.КоличествоЭлементовВМассиве = 2;
	СтруктураДанных.Комментарий = "Тест";
	СтруктураДанных.МассивЧисел.Добавить(1);
	СтруктураДанных.МассивЧисел.Добавить(10);
	СтруктураДанных.Проверить();
	Ответ = ПолучитьСреднее(СтруктураДанных);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПакет(Команда)
	СформироватьПакетНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСреднее(СтруктураДанных)

	СтруктураДанных.Проверить();
	Сумма = 0;
	Для Каждого ЭлМассива из СтруктураДанных.МассивЧисел Цикл
		
		Сумма = Сумма + ЭлМассива;
		
	КонецЦикла;	
	
	Возврат Сумма/СтруктураДанных.КоличествоЭлементовВМассиве;

КонецФункции // ПолучитьСреднее()
