
&НаСервере
Процедура ПодключитьсяЧерезСтатическуюСсылкуНаСервере()
	Соединение = WSСсылки.ФункцииДляРасчета.СоздатьWSПрокси("ФункцииДляРасчета","ФункцииДляРасчета","ФункцииДляРасчетаSoap");
	Операция = Соединение.ТочкаПодключения.Интерфейс.Операции.Получить("ПолучитьСреднее");
	СтруктураДанных = Соединение.ФабрикаXDTO.Создать(Операция.Параметры.Получить("СтруктураДанных").Тип);
	СтруктураДанных.КоличествоЭлементовВМассиве = 2;
	СтруктураДанных.Комментарий = "Тест";
	СтруктураДанных.МассивЧисел.Добавить(3);
	СтруктураДанных.МассивЧисел.Добавить(6);
	СтруктураДанных.Проверить();
	Ответ = Соединение.ПолучитьСреднее(СтруктураДанных);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПакет(Команда)
	СформироватьПакетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьПакетНаСервере()
		Ответ = Десериализовать(ПередатьСериализациюНаСервере());
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьсяЧерезСтатическуюСсылку(Команда)
	ПодключитьсяЧерезСтатическуюСсылкуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередатьСериализациюНаСервере()
	Соединение = WSСсылки.ФункцииДляРасчета.СоздатьWSПрокси("ФункцииДляРасчета","ФункцииДляРасчета","ФункцииДляРасчетаSoap");
	//Операция = Соединение.ТочкаПодключения.Интерфейс.Операции.Получить("ПолучитьСреднее");
	СтруктураДанных = Новый Структура("КоличествоЭлементовВМассиве, Комментарий, МассивЧисел",0,"",Новый Массив);
	СтруктураДанных.КоличествоЭлементовВМассиве = 2;
	СтруктураДанных.Комментарий = "Тест";
	СтруктураДанных.МассивЧисел.Добавить(3);
	СтруктураДанных.МассивЧисел.Добавить(6);
	ОтветСервера = Соединение.ПолучитьСреднее(Неопределено, Сериализовать(СтруктураДанных));
	Возврат ОтветСервера;
КонецФункции

&НаКлиенте
Процедура ПередатьСериализацию(Команда)
	ПередатьСериализациюНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция Сериализовать(ОбъектСериализации)

	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	Возврат МойXML.Закрыть();
	
КонецФункции // Сериализовать()

&НаСервереБезКонтекста
Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	Возврат ТЗ;
	
КонецФункции