
Функция ПолучитьСреднее(СтруктураДанных, СериализованнаяСтруктураДанных)
	
	Если ЗначениеЗаполнено(СтруктураДанных) Тогда
		СтруктураДанных.Проверить();
		Структура = СтруктураДанных;
	Иначе
		Структура = Десериализовать(СериализованнаяСтруктураДанных);
	КонецЕсли;	
	
	Сумма = 0;
	Для Каждого ЭлМассива из Структура.МассивЧисел Цикл
		
		Сумма = Сумма + ЭлМассива;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник1.Ссылка КАК Ссылка,
		|	Справочник1.ВерсияДанных КАК ВерсияДанных,
		|	Справочник1.ПометкаУдаления КАК ПометкаУдаления,
		|	Справочник1.Код КАК Код,
		|	Справочник1.Наименование КАК Наименование,
		|	Справочник1.Предопределенный КАК Предопределенный,
		|	Справочник1.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.Справочник1 КАК Справочник1";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат Сериализовать(РезультатЗапроса);
	//Возврат Сумма/Структура.КоличествоЭлементовВМассиве;
	
КонецФункции

Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	Возврат ТЗ;
	
КонецФункции	

Функция Сериализовать(ОбъектСериализации)

	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	Возврат МойXML.Закрыть();
	
КонецФункции // Сериализовать()